<?
$MESS["IBLOCK_TYPE_TIP"]						= "Из выпадающего списка можно выбрать один из созданных в системе типов инфоблоков. Инфоблоки, созданные для выбранного типа, будут подгружены после нажатия кнопки <b><i>ок</i></b>.";
$MESS["IBLOCK_ID_TIP"]							= "В списке представлены все инфоблоки, созданные для установленного типа либо все инфоблоки системы, если тип не выбран. Можно выбрать один из инфоблоков либо пункт <i>другое</i>, тогда в поле рядом необходимо указать код инфоблока, например, ={\$_REQUEST[\"IBLOCK_ID\"]}.";

$MESS["VARIABLE_ALIASES_ELEMENT_ID_TIP"]		= "Задается переменная, в которой будет передаваться ID элемента, например, ELEMENT_ID.";
$MESS["SEF_MODE_TIP"] 							= "Опция включает режим поддержки ЧПУ. ";
$MESS["SEF_FOLDER_TIP"]							= "Путь до папки, с которой работает компонент. Путь может как существовать физически, так и не существовать.";
$MESS["SEF_URL_TEMPLATES_list_TIP"]				= "Поле, в котором определяется путь к общему списку элементов. Переход на эту страницу будет происходить по ссылке <i>Вернуться к списку</i>.";
$MESS["SEF_URL_TEMPLATES_detail_TIP"]			= "В данном поле указывается путь к странице детального просмотра. В качестве параметра должно передаваться ID элемента.";

$MESS["SORT_BY1_TIP"]							= "В списке перечислены поля, по которым может проводиться сортировка объектов. Также можно выбрать пункт <i>другое</i> и задать в поле рядом код нужного поля.";
$MESS["SORT_ORDER1_TIP"]						= "По возрастанию либо по убыванию.";
$MESS["SORT_BY2_TIP"]							= "В списке перечислены поля, по которым может проводиться сортировка объектов. Также можно выбрать пункт <i>другое</i> и задать в поле рядом код нужного поля.";
$MESS["SORT_ORDER2_TIP"]						= "По возрастанию либо по убыванию.";

$MESS["FILTER_NAME_TIP"]						= "Задается имя переменной, в которой передается массив параметров для фильтрации. Служит для определения выходящих из фильтра элементов. Поле может быть оставлено пустым, тогда используется значение по умолчанию.";

$MESS["LIST_MAP_BIG_TIP"]						= "Отображает большую яндекс карту с расположением точек всех просматриваемых объектов на странице.";
$MESS["LIST_COUNT_TIP"] 						= "Указывается количество элементов, которые будут выведены на одной странице.";
$MESS["LIST_COVER_PHOTO_TIP"] 					= "Отображать главную фотографию объекта или скрыть. Если фотография не найдена, по умолчанию отобразится заглушка.";
$MESS["LIST_PROPS_EMPTY_TIP"] 					= "При отмеченной опции будут отображены все выбранные свойства объекта, включая пустые значения.";
$MESS["LIST_DESC_TIP"] 							= "При отмеченной опции будет отображено описание объекта.";
$MESS["LIST_PROPS_TIP"] 						= "Выбирите одно или несколько свойсвт, которые будут отображены в списке у каждого объекта. Выбрать несколько свойсвт можно при помощи мыши и зажатой клавиши Сtrl.";

$MESS["DETAIL_PHOTOS_TIP"]						= "При отмеченной опции будут отображены все фотографии объекта и изображения планировок.";
$MESS["DETAIL_MAP_TIP"]							= "При отмеченной опции будет отображена яндекс карта с отмеченной точкой местоположения объекта.";
$MESS["DETAIL_VIDEO_TIP"]						= "При отмеченной опции будет отображено видео указанное для объекта.";
$MESS["DETAIL_AGENT_TIP"]						= "При отмеченной опции будет отображена карточка с информацией агента привязанного к объекту.";
$MESS["DETAIL_TEXT_TIP"]						= "При отмеченной опции будет отображено описание к объекту.";
$MESS["DETAIL_PROPS_EMPTY_TIP"] 				= "При отмеченной опции будут отображены все выбранные свойства объекта, включая пустые значения.";
$MESS["DETAIL_PROPS_TIP"] 						= "Выбирите одно или несколько свойсвт, которые будут отображены на странице объекта. Выбрать несколько свойсвт можно при помощи мыши и зажатой клавиши Сtrl.";

$MESS["AJAX_MODE_TIP"]							= "Включение для компонента режима AJAX.";
$MESS["AJAX_OPTION_JUMP_TIP"]					= "Если пользователь совершит AJAX-переход, то по окончании загрузки произойдет прокрутка к началу компонента.";
$MESS["AJAX_OPTION_STYLE_TIP"]					= "При совершении AJAX-переходов будет происходить подгрузка и обработка списка стилей, вызванных компонентом.";
$MESS["AJAX_OPTION_HISTORY_TIP"]				= "Когда пользователь выполняет AJAX-переходы, то при включенной опции можно использовать кнопки браузера \"Назад\" и \"Вперед\".";

$MESS["CACHE_TYPE_TIP"] 						= "<i>Авто</i>: действует при включенном кешировании в течение заданного времени;<br /><i>Кешировать</i>: для кеширования необходимо определить только время кеширования;<br /><i>Не кешировать</i>: кеширования нет в любом случае.";
$MESS["CACHE_TIME_TIP"] 						= "Поле служит для указания времени кеширования в секундах.";
$MESS["CACHE_GROUPS_TIP"] 						= "При отмеченной опции будут учитываться права доступа при кешировании.";

$MESS["DISPLAY_TOP_PAGER_TIP"]					= "При отмеченной опции навигация по страницам будет выведена наверху страницы.";
$MESS["DISPLAY_BOTTOM_PAGER_TIP"]				= "При отмеченной опции навигация по страницам будет выведена внизу страницы.";
$MESS["PAGER_TITLE_TIP"]						= "Указывается название категорий, по которым происходит перемещение при навигации (например, страницы, части, главы и др.)";
$MESS["PAGER_TEMPLATE_TIP"]						= "В данном поле указывается имя шаблона постраничной навигации. Если поле пусто, то выбирается шаблон по умолчанию (<i>.default</i>).";
$MESS["PAGER_SHOW_ALL_TIP"]						= "При отмеченной опции будет отображена ссылка для просмотра объекта целиком, без использования постраничной навигации.";

$MESS["DETAIL_DISPLAY_TOP_PAGER_TIP"] 			= "При отмеченной опции навигация по страницам будет выведена вверху страницы, над списком.";
$MESS["DETAIL_DISPLAY_BOTTOM_PAGER_TIP"] 		= "При отмеченной опции навигация по страницам будет выведена внизу страницы, под списком.";
$MESS["DETAIL_PAGER_TITLE_TIP"] 				= "Название категорий, по которым происходит перемещение при детальном просмотре (например, страница, глава и др.)";
$MESS["DETAIL_PAGER_TEMPLATE_TIP"] 				= "Имя шаблона постраничной навигации. Если поле пусто, то выбирается шаблон по умолчанию (<i>.default</i>). Также в системе задан шаблон <i>orange</i>.";
$MESS["DETAIL_PAGER_SHOW_ALL_TIP"] 				= "При отмеченной опции будет отображена ссылка для просмотра объекта целиком, без использования постраничной навигации.";

$MESS["SET_TITLE_TIP"] 							= "При отмеченной опции в качестве заголовка страницы будет установлено имя текущего раздела.";
$MESS["SET_BROWSER_TITLE_TIP"] 					= "При установленной опции в качестве заголовка окна браузера будет установлено название элемента или ключевые слова страницы по заданному SEO-шаблону";
$MESS["BROWSER_TITLE_TIP"] 						= "Можно выбрать заголовок из значения свойства.";
$MESS["SET_META_KEYWORDS_TIP"] 					= "При отмеченной опции будут установлены ключевые слова страницы по заданному SEO-шаблону";
$MESS["META_KEYWORDS_TIP"] 						= "Можно выбрать ключевые слова из значения свойства.";
$MESS["SET_META_DESCRIPTION_TIP"] 				= "При отмеченной опции будет установлено описание страницы по заданному SEO-шаблону.";
$MESS["META_DESCRIPTION_TIP"] 					= "Можно выбрать описание страницы из значения свойства.";
$MESS["SET_STATUS_404_TIP"] 					= "Отображать ошибку 404 если элемент не найден.";
$MESS["INCLUDE_IBLOCK_INTO_CHAIN_TIP"] 			= "При установленной опции в цепочку навигации будет добавлено имя элемента инфоблока.";
$MESS["ADD_ELEMENT_CHAIN_TIP"] 					= "Если опция установлена, то название элемента будет добавлено в цепочку навигации";
$MESS["USE_PERMISSIONS_TIP"] 					= "Опция позволяет ограничить доступ к детальной информации элементов инфоблока.";
$MESS["GROUP_PERMISSIONS_TIP"] 					= "Выведены все группы пользователей, среди которых можно выбрать те, которые смогут просматривать детальную информацию.";
?>